x230/.local/bin/backup-mount-check
#!/usr/bin/env bash
# Mount helpers

# Shared helper function sourced by all backup scripts to check mount
# points directly (no symlink indirection).


# [[file:../../../backup.org::*Mount helpers][Mount helpers:1]]
# Shared mount-point checker for backup scripts.
# Source this file, then call: require_mount /mnt/ironwolf01 [/mnt/ironwolf02 ...]

require_mount() {
  for mp in "$@"; do
    if ! mountpoint -q "$mp" 2>/dev/null; then
      echo "ERROR: $mp is not mounted. Aborting." >&2
      exit 1
    fi
  done
}
# Mount helpers:1 ends here
