x230/.local/bin/backup-system
#!/usr/bin/env bash
# backup-system – System mirror to ironwolf02

# Mirrors =/= to =/mnt/ironwolf02/backup-xubuntu/backup-xubuntu/= using
# rsync with filter rules. Guard file prevents writing to wrong target.


# [[file:../../../backup.org::*backup-system – System mirror to ironwolf02][backup-system – System mirror to ironwolf02:1]]
set -Eeuo pipefail

# ===== CONFIG =====
DEST_BASE="/mnt/ironwolf02/backup-xubuntu"
DEST="${DEST_BASE}/backup-xubuntu"               # final mirror dir
GUARD_FILE=""
OWNER_FILE=""
LOG="/tmp/backup_system_$(date +%Y%m%d_%H%M%S).log"

# Resolve the real backup owner even when the script is launched via sudo.
BACKUP_USER="${SUDO_USER:-$(id -un)}"
BACKUP_GROUP="${SUDO_GID:+$(getent group "$SUDO_GID" | cut -d: -f1)}"
BACKUP_GROUP="${BACKUP_GROUP:-$(id -gn "$BACKUP_USER")}"
USER_HOME="$(getent passwd "$BACKUP_USER" | cut -d: -f6)"
USER_HOME="${USER_HOME:-$HOME}"

refresh_dest_paths() {
  local base="${DEST%/}"
  GUARD_FILE="${base}/.backup_guard"
  OWNER_FILE="${base}/.backup_owner"
}
refresh_dest_paths

# Filters: use env FILTERS_FILE if provided, else your user default
FILTERS_FILE="${FILTERS_FILE:-$USER_HOME/.config/backup/system-filters.rsync}"

# Keep backup trees owned by the real user even when rsync runs as root.
RSYNC_OWNERSHIP=()
if [ -n "${SUDO_USER:-}" ]; then
  RSYNC_OWNERSHIP=( "--chown=${BACKUP_USER}:${BACKUP_GROUP}" )
fi

# Default rsync arg arrays (real vs dry)
RSYNC_RUN=( -aAX --delete --numeric-ids --info=stats2,progress2 --no-owner --no-group "${RSYNC_OWNERSHIP[@]}" --filter="merge $FILTERS_FILE" )
RSYNC_DRY=( -aAXn --delete --itemize-changes --numeric-ids --no-owner --no-group "${RSYNC_OWNERSHIP[@]}" --filter="merge $FILTERS_FILE" )

# ===== ARGS =====
MODE="" AUTO=0
while (($#)); do
  case "$1" in
    -y|--yes) MODE="yes";;
    -n|--dry|--dry-run) MODE="dry";;
    --auto) AUTO=1;;
    --dest) DEST="${2:?}"; shift;;                       # optional override
    --filters|--filter-file) FILTERS_FILE="${2:?}"; shift;;
    -h|--help)
      cat <<EOF
Usage: $(basename "$0") [-n|--dry-run | -y|--yes] [--auto]
       [--dest PATH] [--filters FILE]
Mirrors "/" into ${DEST} using rsync + your filter rules.
Guards:
  * Requires /mnt/ironwolf02 mounted; DEST must be under backup-xubuntu
  * Must-type DEST confirmation (unless -n|-y provided)
  * Creates/uses ${GUARD_FILE} sentinel
EOF
      exit 0;;
    *) echo "Unknown option: $1" >&2; exit 1;;
  esac; shift
done
refresh_dest_paths

# ===== Utils =====
die(){ echo "ERROR: $*" >&2; exit 1; }
hr(){ command -v numfmt >/dev/null 2>&1 && numfmt --to=iec --suffix=B "$1" || echo "$1 B"; }
avail_bytes(){ df -P -B1 "$1" | awk 'NR==2{print $4}'; }
canon(){ readlink -f -- "$1" 2>/dev/null || printf '%s' "$1"; }
dest_writable() {
  local path="$1"
  if [ -n "${SUDO_USER:-}" ]; then
    sudo -u "$BACKUP_USER" test -w "$path"
  else
    [ -w "$path" ]
  fi
}
repair_dest_ownership() {
  local path="$1" want="${BACKUP_USER}:${BACKUP_GROUP}"
  [ -n "${SUDO_USER:-}" ] || return 0
  if [ -f "$OWNER_FILE" ] && [ "$(cat "$OWNER_FILE" 2>/dev/null || true)" = "$want" ]; then
    chown "$want" "$path" "$GUARD_FILE" "$OWNER_FILE" 2>/dev/null || true
    return 0
  fi
  echo "[*] Repairing destination ownership to $want"
  chown -R "$want" "$path"
  printf '%s\n' "$want" > "$OWNER_FILE"
  chown "$want" "$OWNER_FILE"
  chmod 644 "$OWNER_FILE"
}

ensure_filters() {
  [ -f "$FILTERS_FILE" ] || die "Missing filters file: $FILTERS_FILE"
  [ -r "$FILTERS_FILE" ] || die "Filters not readable: $FILTERS_FILE"
}

dest_sanity() {
  # Mount check — direct, no symlinks
  mountpoint -q /mnt/ironwolf02 || die "/mnt/ironwolf02 not mounted"

  # DEST must live under backup-xubuntu, not be the mount root or /
  local cdest; cdest="$(canon "$DEST")"
  [[ "$cdest" == /mnt/ironwolf02/backup-xubuntu/* ]] || die "Refusing DEST outside /mnt/ironwolf02/backup-xubuntu: $cdest"
  [[ "$cdest" != "/" && "$cdest" != "/mnt/ironwolf02" && "$cdest" != "/mnt/ironwolf02/" ]] || die "Refusing dangerous DEST: $cdest"

  mkdir -p "$cdest"
  DEST="$(canon "$cdest")"
  refresh_dest_paths

  # Guard/sentinel: ensure this target *is* a system mirror target
  if [ ! -f "$GUARD_FILE" ]; then
    {
      echo "system mirror target (rsync from /)"
      echo "DEST=$(canon "$cdest")"
      echo "FSTYPE=$(findmnt -no FSTYPE --target "$cdest")"
      echo "DEV=$(findmnt -no SOURCE --target "$cdest")"
      echo "CREATED=$(date -Is)"
    } > "$GUARD_FILE"
    chmod 644 "$GUARD_FILE"
  else
    grep -q "system mirror target (rsync from /)" "$GUARD_FILE" \
      || die "Guard file exists but does not look like a system mirror target: $GUARD_FILE"
  fi

  repair_dest_ownership "$DEST"

  # Ensure writable as your user (so non-root runs don't silently fail)
  dest_writable "$DEST" || die "Destination not writable by $BACKUP_USER. Try: sudo chown -R $BACKUP_USER:$BACKUP_GROUP '$DEST'"
}

stats() {
  # Estimate with the SAME filters
  rsync -aAXn --delete --stats --numeric-ids --no-owner --no-group \
    --filter="merge $FILTERS_FILE" / "${DEST%/}/" \
  | awk -F': *' '
      /Total file size:/ {gsub(/,| bytes/,"",$2); t=$2}
      /Total transferred file size:/ {gsub(/,| bytes/,"",$2); x=$2}
      END {print t? t:0, x? x:0}'
}

prompt() {
  local d dev; d="$(canon "$DEST")"
  dev="$(findmnt -no SOURCE,TARGET,FSTYPE --target "$d" 2>/dev/null || true)"
  read -r t x < <(stats); f="$(avail_bytes "$d")"

  echo "================ SYSTEM MIRROR ================"
  echo "SRC : /"
  echo "DEST: $d  ($dev)"
  echo "CMD : rsync ${RSYNC_RUN[*]} / \"$d/\""
  echo "Size total=$(hr "$t")  xfer~=$(hr "$x")  free=$(hr "$f")"
  echo "Filters: $FILTERS_FILE"
  echo "=============================================="

  # If mode preselected, skip asking.
  case "${MODE:-}" in
    dry) echo "[DRY MODE] Skipping confirmation."; return ;;
    yes) echo "[AUTO YES] Proceeding without prompt."; return ;;
  esac
  (( AUTO )) && { [ -n "$MODE" ] || die "--auto requires -n or -y"; return; }

  # Must-type confirmation
  read -rp "Type EXACT DEST path to confirm, or 'd' for dry-run, or 'n' to abort: " ans
  case "$ans" in
    n|N) exit 0;;
    d|D) MODE="dry";;
    *)   [[ "$(canon "$ans")" = "$d" ]] || die "Confirmation mismatch"; MODE="yes";;
  esac
}

run() {
  local d; d="$(canon "$DEST")"
  if [ "${MODE:-}" = "dry" ]; then
    rsync "${RSYNC_DRY[@]}" / "$d/" | tee "$LOG"
  else
    ionice -c2 -n7 nice -n 19 rsync "${RSYNC_RUN[@]}" / "$d/" | tee "$LOG"
  fi
  echo "Log: $LOG"
}

main() {
  ensure_filters
  dest_sanity
  prompt
  run
}
main "$@"
# backup-system – System mirror to ironwolf02:1 ends here
