x230/.local/bin/backup-dotcortex
#!/usr/bin/env bash
# backup-dotcortex – Mirror DotCortex to ironwolf02

# Simple mirror of =~/DotCortex= to ironwolf02.
# No timestamped copies — just a current mirror.


# [[file:../../../backup.org::*backup-dotcortex – Mirror DotCortex to ironwolf02][backup-dotcortex – Mirror DotCortex to ironwolf02:1]]
set -Eeuo pipefail

SRC="$HOME/DotCortex"
DESTS=(
  /mnt/ironwolf02/backup-dotfiles/DotCortex
)
MOUNTS=( /mnt/ironwolf02 )

RSYNC_RUN=( -aH --delete --info=stats2,progress2 --no-owner --no-group )
RSYNC_DRY=( -anv --delete --itemize-changes --no-owner --no-group )

MODE="" AUTO=0
while (($#)); do
  case "$1" in
    -y|--yes) MODE="yes";;
    -n|--dry|--dry-run) MODE="dry";;
    --auto) AUTO=1;;
    -h|--help)
      cat <<EOF
Usage: $(basename "$0") [-n|--dry-run] [-y|--yes] [--auto]
Mirrors ~/DotCortex to ironwolf02.
EOF
      exit 0;;
    *) echo "Unknown: $1" >&2; exit 1;;
  esac; shift
done

die(){ echo "ERROR: $*" >&2; exit 1; }

[ -d "$SRC" ] || die "Source not found: $SRC"

for mp in "${MOUNTS[@]}"; do
  mountpoint -q "$mp" || die "$mp is not mounted"
done

if (( AUTO )); then
  [ -n "$MODE" ] || die "--auto requires -n or -y"
elif [ -z "$MODE" ]; then
  echo "SRC:  $SRC"
  for d in "${DESTS[@]}"; do echo "DEST: $d"; done
  read -rp "Proceed? [y/n/d(ry)] " ans
  case "$ans" in
    y|Y) MODE="yes";;
    d|D) MODE="dry";;
    *)   exit 0;;
  esac
fi

for dest in "${DESTS[@]}"; do
  mkdir -p "$dest"
  echo "[*] Syncing to $dest"
  if [ "$MODE" = "dry" ]; then
    rsync "${RSYNC_DRY[@]}" "$SRC/" "$dest/"
  else
    rsync "${RSYNC_RUN[@]}" "$SRC/" "$dest/"
  fi
  echo "[✓] Done: $dest"
  echo
done
# backup-dotcortex – Mirror DotCortex to ironwolf02:1 ends here
