t480s/.local/bin/backup-dotcortex
#!/usr/bin/env bash
# backup-dotcortex (T480s) – Push DotCortex to X230 via rsync+SSH

# Runs on T480s. Pushes =~/DotCortex= over SSH to X230's ironwolf02 backup volume,
# creating a timestamped snapshot: =DotCortex-T480s-{TIMESTAMP}/=.
# This helper stays source-owned here so the T480s checkout can tangle it back
# whenever the overlay is refreshed.

# Requires =x230= to be reachable (SSH alias in =~/.ssh/config=) and
# =/mnt/ironwolf02/backup-dotfiles= to be mounted on X230.


# [[file:../../../backup.org::*backup-dotcortex (T480s) – Push DotCortex to X230 via rsync+SSH][backup-dotcortex (T480s) – Push DotCortex to X230 via rsync+SSH:1]]
# backup-dotcortex (T480s) – Push DotCortex to X230 via rsync+SSH

# Runs on T480s. Pushes =~/DotCortex= over SSH to X230's ironwolf02 backup volume,
# creating a timestamped snapshot: =DotCortex-T480s-{TIMESTAMP}/=.
# This helper stays source-owned here so the T480s checkout can tangle it back
# whenever the overlay is refreshed.

set -Eeuo pipefail

SRC="$HOME/DotCortex"
REMOTE_HOST="x230"
REMOTE_BACKUP_DIR="/mnt/ironwolf02/backup-dotfiles"
TIMESTAMP="$(date +%Y%m%d-%H%M%S)"
REMOTE_DEST="${REMOTE_BACKUP_DIR}/DotCortex-T480s-${TIMESTAMP}"

MODE="" AUTO=0
while (($#)); do
  case "$1" in
    -y|--yes) MODE="yes";;
    -n|--dry|--dry-run) MODE="dry";;
    --auto) AUTO=1;;
    -h|--help)
      echo "Usage: $(basename "$0") [-n|--dry-run] [-y|--yes] [--auto]"
      echo "Pushes ~/DotCortex via rsync+ssh to ${REMOTE_HOST}:${REMOTE_DEST}/"
      exit 0;;
    *) echo "Unknown: $1" >&2; exit 1;;
  esac; shift
done

die(){ echo "ERROR: $*" >&2; exit 1; }

[ -d "$SRC/.git" ] || die "Not a git repo: $SRC"

if (( AUTO )); then
  [ -n "$MODE" ] || die "--auto requires -n or -y"
elif [ -z "$MODE" ]; then
  echo "SRC : $SRC"
  echo "DEST: ${REMOTE_HOST}:${REMOTE_DEST}"
  read -rp "Proceed? [y/n/d(ry)] " ans
  case "$ans" in
    y|Y) MODE="yes";;
    d|D) MODE="dry";;
    *)   exit 0;;
  esac
fi

if [ "$MODE" = "dry" ]; then
  echo "[dry] Checking connectivity to ${REMOTE_HOST}..."
  ssh -o BatchMode=yes -o ConnectTimeout=5 "$REMOTE_HOST" true \
    || die "${REMOTE_HOST} unreachable"
  echo "[dry] Would create: ${REMOTE_HOST}:${REMOTE_DEST}"
  echo "[dry] Would run:    rsync -aH --no-owner --no-group $SRC/ ${REMOTE_HOST}:${REMOTE_DEST}/"
  echo "(dry run — no files written)"
  exit 0
fi

ssh -o BatchMode=yes -o ConnectTimeout=5 "$REMOTE_HOST" \
  "[ -d '${REMOTE_BACKUP_DIR}' ]" \
  || die "${REMOTE_HOST} unreachable or ${REMOTE_BACKUP_DIR} missing — is ironwolf02 mounted on X230?"

ssh "$REMOTE_HOST" "mkdir -p '${REMOTE_DEST}'"
echo "[*] Syncing: $SRC -> ${REMOTE_HOST}:${REMOTE_DEST}"
rsync -aH --no-owner --no-group --info=stats2,progress2 "$SRC/" "${REMOTE_HOST}:${REMOTE_DEST}/"
echo "[✓] Done: ${REMOTE_HOST}:${REMOTE_DEST}"
# backup-dotcortex (T480s) – Push DotCortex to X230 via rsync+SSH:1 ends here
