backup.org
* backup-games – Games mirror to ironwolf01

Mirrors =$HOME/Games= to =/mnt/ironwolf01/backup-games/Games=.

#+BEGIN_SRC bash :tangle x230/.local/bin/backup-games :shebang "#!/usr/bin/env bash" :mkdirp yes
set -Eeuo pipefail

# === CONFIG ===
SRC="${HOME}/Games"
BASE="/mnt/ironwolf01/backup-games"
DEST="${BASE}/Games"
GUARD_FILE="${DEST}/.backup_guard"
LOG="/tmp/backup_games_$(date +%Y%m%d_%H%M%S).log"
RSYNC_BASE_OPTS=( -aH --delete --info=stats2,progress2 --no-owner --no-group --exclude='.backup_guard' )
RSYNC_DRY_OPTS=( -anv --delete --itemize-changes --no-owner --no-group --exclude='.backup_guard' )

# === ARGS ===
MODE="" AUTO=0
while (($#)); do
  case "$1" in
    -y|--yes)     MODE="yes" ;;
    -n|--dry|--dry-run) MODE="dry" ;;
    --auto)       AUTO=1 ;;
    -h|--help)
      echo "Usage: $(basename "$0") [-n|--dry-run] [-y|--yes] [--auto]"
      echo "  -y, --yes    Perform real sync"
      echo "  -n           Dry-run"
      echo "  --auto       Non-interactive (combine with -n or -y)"
      exit 0 ;;
    *) echo "ERROR: Unknown arg: $1" >&2; exit 1 ;;
  esac; shift
done

# === UTILS ===
hr(){ command -v numfmt >/dev/null 2>&1 && numfmt --to=iec --suffix=B "$1" || echo "$1 B"; }
avail_bytes(){ df -P -B1 "$1" | awk 'NR==2{print $4}'; }
src_real(){ readlink -f "$SRC"; }
dest_real(){ readlink -f "$DEST" || echo "$DEST"; }
die(){ echo "ERROR: $*" >&2; exit 1; }

# === SAFETY CHECKS ===
safety_checks() {
  mountpoint -q /mnt/ironwolf01 || die "/mnt/ironwolf01 is not mounted"
  mkdir -p "$DEST"
  [ -d "$BASE" ] || die "Missing base dir: $BASE"
  [ "$(dest_real)" != "/mnt/ironwolf01" ] || die "Refusing to target mount root"
  [ "$(dest_real)" != "$BASE" ] || die "Refusing to target $BASE (must be $DEST)"
  # guard file
  if [ ! -f "$GUARD_FILE" ]; then
    echo "Creating guard file at $GUARD_FILE"
    {
      echo "This directory is the rsync mirror target for \$HOME/Games"
      echo "SRC=$(src_real)"
      echo "DEST=$(dest_real)"
      echo "CREATED=$(date -Is)"
    } | tee "$GUARD_FILE" >/dev/null
    chmod 644 "$GUARD_FILE"
  fi
  [ -w "$(dest_real)" ] || die "Destination not writable by $(id -un). Fix: sudo chown -R $(id -un):$(id -gn) '$(dest_real)'"
}

# === PREVIEW / STATS ===
rsync_stats() {
  rsync -an --delete --stats "$(src_real)/" "$(dest_real)/" 2>/dev/null \
  | awk -F': *' '
    /Total file size:/ {gsub(/,| bytes/,"",$2); t=$2}
    /Total transferred file size:/ {gsub(/,| bytes/,"",$2); x=$2}
    END {print t? t:0, x? x:0}'
}

prompt_mode() {
  local SRC_R; SRC_R="$(src_real)"
  local DEST_R; DEST_R="$(dest_real)"
  local dev; dev="$(findmnt -no SOURCE,TARGET,FSTYPE --target "$DEST_R" 2>/dev/null || true)"

  echo "------------------------------------------------------------"
  echo "About to run rsync WITH --delete"
  echo "FROM: $SRC_R"
  echo "TO:   $DEST_R"
  echo "DEV:  $dev"
  echo "CMD:  rsync ${RSYNC_BASE_OPTS[*]} \"$SRC_R/\" \"$DEST_R/\""
  echo "------------------------------------------------------------"

  if (( AUTO )); then
    [ -n "$MODE" ] || die "--auto requires -n or -y"
    return
  fi
  read -rp "Type EXACT DEST path to confirm, or 'd' for dry-run, or 'n' to abort: " ans
  case "$ans" in
    n|N) exit 0 ;;
    d|D) MODE="dry" ;;
    *)
      if [ "$ans" = "$DEST_R" ]; then MODE="yes"; else die "Confirmation mismatch. Aborting."; fi
      ;;
  esac
}

run_sync() {
  local SRC_R; SRC_R="$(src_real)"
  local DEST_R; DEST_R="$(dest_real)"

  read -r total xfer < <(rsync_stats)
  local free; free="$(avail_bytes "$DEST_R")"

  echo "[info] Source total: $(hr "$total")"
  echo "[info] Est. xfer:    $(hr "$xfer")"
  echo "[info] Free on dest: $(hr "$free")"
  [ "$xfer" -gt "$free" ] && echo "[warn] Estimated transfer exceeds free space"

  if [ "${MODE:-}" = "dry" ]; then
    echo "[*] DRY-RUN start"
    rsync "${RSYNC_DRY_OPTS[@]}" "$SRC_R/" "$DEST_R/" | tee "$LOG"
    echo "[*] DRY-RUN log: $LOG"
  else
    echo "[*] SYNC start"
    rsync "${RSYNC_BASE_OPTS[@]}" "$SRC_R/" "$DEST_R/" | tee "$LOG"
    echo "[✓] SYNC complete. Log: $LOG"
  fi
}

main() {
  safety_checks
  prompt_mode
  run_sync
}
main "$@"
#+END_SRC

